function GetOperatorsTagPair () {

    const retDict = {

        // ******************************** 星6 ********************************
        // 先鋒

        // 前衛
        Chen : [["上級エリート","爆発力"]],
        SilverAsh : [["上級エリート","前衛","支援"]],

        // 重装
        Hoshiguma : [["上級エリート","重装","火力"], ["上級エリート","防御","火力"]],
        Saria : [["上級エリート","重装","支援"],["上級エリート","防御","支援"],["上級エリート","重装","治療"],["上級エリート","防御","治療"],["上級エリート","近距離","治療"]],
        
        // 狙撃
        Rosa : [["上級エリート","狙撃","牽制"]],

        // 術師
        Ifrit : [["上級エリート","術師","弱化"],["上級エリート","範囲攻撃","弱化"]],
        Ceobe : [["上級エリート","術師","火力"],["上級エリート","術師","火力","牽制"]],
        Mostima : [["上級エリート","術師","支援"],["上級エリート","範囲攻撃","支援"],["上級エリート","術師","範囲攻撃","牽制"]],

        // 医療

        // 補助
        Magallan : [["上級エリート","補助"],["上級エリート","減速"]],

        // 特殊
        Phantom : [["上級エリート","高速再配置"],["上級エリート","特殊","高速再配置"]],
        Aak : [["上級エリート","特殊","支援"],["上級エリート","特殊","遠距離","支援"]],
        Weedy : [["上級エリート","強制移動"],["上級エリート","特殊","強制移動"]],



        // ******************************** 星5 ********************************
        // 先鋒
        Reed : [["エリート","先鋒","火力"],["エリート","COST回復","火力"]],
        Texas : [["先鋒","牽制"],["COST回復","牽制"]],

        // 前衛
        Indra : [["エリート","前衛","火力","生存"]],
        Swire : [["エリート","前衛","支援"],["エリート","火力","支援"]],
        Astesia : [["前衛","防御"]],

        // 重装、
        Croissant : [["重装","強制移動"],["防御","強制移動"]],
        Vulcan : [["重装","生存"],["防御","生存"]],

        // 狙撃
        Firewatch : [["狙撃","爆発力"]],

        // 術師
        Nightmare : [["術師","治療"],["火力","治療"],["エリート","術師","減速"],["エリート","治療","減速"],["術師","火力","減速"]],
        Leonhardt : [["術師","爆発力"],["爆発力","範囲攻撃"]],

        // 医療

        // 補助
        Mayer : [["召喚"]],
        Glaucus : [["牽制","減速"]],
        Istina : [["補助","火力"]],
        Tsukinogi : [["補助","生存"],["補助","支援"],["生存","支援"],["エリート","遠距離","生存"]],
        
        // 特殊
        ProjektRed : [["特殊","牽制"],["高速再配置","牽制"]],
        WaaiFu : [["特殊","弱化"],["高速再配置","弱化"],["近距離","弱化"]],
        Manticore : [["特殊","生存"]],
        Cliffheart : [["強制移動","火力"]],
        FEater : [["特殊","減速"],["強制移動","減速"],["エリート","近距離","減速"]],


        // ******************************** 星4 ********************************
        // 先鋒
        Myrtle : [["先鋒","治療"],["COST回復","治療"]], //テンニンカ

        // 前衛
        Frostleaf : [["前衛","減速"],["近距離","減速"],["火力","減速"]],
        Dobermann : [["支援"],["前衛","支援"],["近距離","支援"]],
        Cutter : [["爆発力"],["前衛","爆発力"],["近距離","爆発力"]],

        // 重装
        
        // 狙撃
        Jessica : [["狙撃","生存"],["遠距離","生存"]],
        Shirayuki : [["狙撃","範囲攻撃","減速"],["範囲攻撃","減速"]],
        May : [["火力","減速"]],
        Ambriel : [["火力","減速"]],
        Meteor : [["弱化"],["狙撃","弱化"],["遠距離","弱化"]],

        // 術師
        Greyy : [["術師","範囲攻撃","減速"],["術師","減速"],["範囲攻撃","減速"]],
        Haze : [["弱化"],["術師","弱化"],["遠距離","弱化"]],

        // 医療
        Purestream : [["支援"],["医療","支援"],["治療","支援"],["遠距離","支援"]], //セイリュウ

        // 補助
        Podenco : [["治療","減速"],["補助","治療"]],

        // 特殊
        Gravel : [["特殊"],["高速再配置"],["高速再配置","防御"]],
        Rope : [["特殊"],["強制移動"]],
        Shaw : [["特殊"],["強制移動"]],

        
        // ******************************** 星1 ********************************
        Castle3 : [["ロボット"],["ロボット","前衛"],["ロボット","近距離"],["ロボット","支援"]],
        JusticeKnight : [["ロボット"],["ロボット","狙撃"],["ロボット","遠距離"],["ロボット","支援"]],
        Lancet2 : [["ロボット"],["ロボット","医療"],["ロボット","治療"],["ロボット","遠距離"]],
        THRMEX : [["ロボット"],["ロボット","特殊"],["ロボット","爆発力"],["ロボット","近距離"]]

    };
    
    return retDict;
};